---
title: PointIterator
classe: Autodesk.Revit.DB.PointClouds.PointIterator
namespace: Autodesk.Revit.DB.PointClouds
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# PointIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `CloudPoint Current { get; }` | `pointIterator.Current` | CloudPoint |
| `Object CurrentObject { get; }` | `pointIterator.CurrentObject` | Object |
| `Boolean IsValidObject { get; }` | `pointIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `pointIterator.Dispose()` | Void |
| `Void Free()` | `pointIterator.Free()` | Void |
| `Boolean IsDone()` | `pointIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `pointIterator.MoveNext()` | Boolean |
| `Void Reset()` | `pointIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```